;(function (){
	xcode = {};
	var token = "〇一二三四五六七八九十乙乚丁丂丅乂乃了人儿入几刀刁力匕卜厂厶又巜万丈上下个丫丸久么义乞也习乡亍于亏亡亿兀兦凡刃劜勺卂千卄卫叉口囗土士夕大女子孑孓寸小尢尣尸屮山巛川工己已巳巾干幺广廾弋弓彐彑彡彳才门飞马不与丏丐丑丒专中丮丰丹为之乌乢乣乤乥书予云互亓井亖亢亣什仁仂仃仄仅仆仇仈仉今介仌仍从仏仐仑仒仓允兂元內公兮兯冃冄内円冇冈冗冘凤凶刅分切刈劝办勻勼勽勾勿匀匁匂化匹区卅卆升午卍卐卝卞卬厄厅历厷厹及友双反収圠圡壬天太夫夬夭孔少尤尹尺屯屲巴巿帀币幻廿开弌引弖心忆戈户手扎支攴攵文斗斤方无旡日曰月木朩欠止歹歺殳毋毌比毛氏气水火爪父爻爿片牙牛犬王瓦艺见计订讣认讥贝车辷邒邓长闩阞队韦风且丕世丗丘丙业丛东丝丱主乍乎乏乐亗仔仕他仗付仙仚仛仜仝仞仟仠仡仢代令以仦仧仨仩仪仫们仮兄兰冉冊冋册写冚冬冭冮冯凥凸凹出击刉刊刋刌刍功加务劢匃匄包匆匇北匛匜匝匞卉半卌卟占卡卢卭卮卯厇厈厉厺去厼叏叐发古句另叧叨叩只叫召叭叮可台叱史右叴叵叶号司叹叺叻叼叽叾囙囚囜圢圣圤圥圦圧壭夃处外夘央夯夰失夲夳头奴奵奶孕宁宂它宄对尒尓尔尕尻尼屳屷左巧巨市布帄帅平幼庀庁庂広廵弁弍弗弘归必忇忉忊戉戊戋戹扏扐扑扒打扔払扖斥旦旧曱未末本札朮术朰正母氐民氕氶氷永氹氺氻氾氿汀汁汃汄汅汇汈汉灭犮犯犰玄玉玊玌玍瓜甘生用甩田由甲申甴电疋白皮皿目矛矢石示礼禾穴立纠肊艻艼艽艾艿芀芁节讦讧讨让讪讫讬训议讯记讱轧辸边辺辻込辽邔邖邗邘邙邚邛邜邝闪阠阡阢阣阤饤饥驭鸟龙丞丟丠両丢乑乒乓乔乨乩乪乫乭乮乯买争亘亙亚交亥亦产仯仰仱仲仳仴仵件价仸仹任仼份仾仿伀企伂伃伄伅伆伇伈伉伊伋伌伍伎伏伐休伒伓伔伕伖众优伙会伛伜伝伞伟传伡伢伣伤伥伦伧伨伩伪伫伬佢佤充兆兇先光兊全共兲关兴再军农冰冱冲决冴凨凩凪凫凼刎刏刐刑划刓刔刕刖列刘则刚创劣劤劥劦劧动匈匟匠匡匢卋华协印危厊压厌厍厽厾叒叿吀吁吂吃各吅吆吇合吉吊吋同名后吏吐向吒吓吔吕吖吗囘囝回囟因囡团団在圩圪圫圬圭圮圯地圱圲圳圴圵圶圷圸圹场圾壮夅夗夙多夛夵夶夷夸夹夺夻夼奷奸她奺奻奼好奾奿妀妁如妃妄妅妆妇妈孖字存孙宅宆宇守安寺寻导尖尗尘尥尦尧尽屰屸屹屺屻屼屽屾屿岀岁岂岃岋岌州巟巡巩帆帇师年幵并庄庅庆延廷异弎式弐弙弚弛弜当彴彵彶忈忋忏忓忔忕忖忙忚忛忣戌戍戎戏成扗托扙扚扛扜扝扞扟扠扡扢扣扤扥扦执扨扩扪扫扬扱收攷旨早旪旫旬旭旮旯曲曳有朱朲朳朴朵朶朷朸朹机朻朼朽朾朿杀杁杂权次欢此死毎毕氒氖気氘氼氽汆汊汋汌汍汎汏汐汑汒汓汔汕汗汘汙汚汛汜汝江池污汢汣汤汲汷灮灯灰灱灲灳爷牝牞牟犱犲犳犴犵犷犸玎玏玐玑瓧甪甶百癿礽祁穵竹米糸纡红纣纤纥约级纨纩纪纫缶网羊羽老考而耒耳聿肉肋肌肍肎臣自至臼舌舛舟艮色艸芃芄芅芆芇芉芊芋芌芍芎芏芐芑芒芓芕芖芗芝芨虍虫血行衣襾西观讲讳讴讵讶讷许讹论讻讼讽设访诀贞负贠轨达辿迀迁迂迃迄迅迆过迈迉邞邟邠邡邢那邤邥邦邧邨邩邪邬邷钆钇闫闬闭问闯阥阦阧阨阩阪阫阬阭阮阯阰阱防阳阴阵阶页饦饧驮驯驰齐吸似寿弄麦形进戒吞远违运扶抚坛技坏扰拒找批扯址走抄坝贡攻赤折抓扮抢孝均抛投坟抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏杆杠杜材村杏极李杨求更束豆两丽医辰励否还歼来连步坚旱盯呈时吴助县里呆园旷围呀吨足邮男困吵串员听吩吹呜吧吼别岗帐财针钉告我乱利秃秀私每兵估体何但伸作伯伶佣低你住位伴身皂佛近彻役返余希坐谷妥含邻岔肝肚肠龟免狂犹角删条卵岛迎饭饮系言冻状亩况床库疗应冷这序辛弃冶忘闲间闷判灶灿弟汪沙汽沃泛沟没沈沉怀忧快完宋宏牢究穷灾良证启评补初社识诉诊词译君灵即层尿尾迟局改张忌际陆阿陈阻附妙妖妨努忍劲鸡驱纯纱纳纲驳纵纷纸纹纺驴纽奉玩环武青责现表规抹拢拔拣担坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌幸招坡披拨择抬其取苦若茂苹苗英范直茄茎茅林枝杯柜析板松枪构杰述枕丧或画卧事刺枣雨卖矿码厕奔奇奋态欧垄妻轰顷转斩轮软到非叔肯齿些虎虏肾贤尚旺具果味昆国昌畅明易昂典固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩购图钓制知垂牧物乖刮秆和季委佳侍供使例版侄侦侧凭侨佩货依的迫质欣征往爬彼径所舍金命斧爸采受乳贪念贫肤肺肢肿胀朋股肥服胁周昏鱼兔狐忽狗备饰饱饲变京享店夜庙府底剂郊废净盲放刻育闸闹郑券卷单炒炊炕炎炉沫浅法泄河沾泪油泊沿泡注泻泳泥沸波泼泽治怖性怕怜怪学宝宗定宜审宙官空帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届刷屈弦承孟孤陕降限妹姑姐姓始驾参艰线练组细驶织终驻驼绍经贯奏春帮珍玻毒型挂封持项垮挎城挠政赴赵挡挺括拴拾挑指垫挣挤拼挖按挥挪某甚革荐巷带草茧茶荒茫荡荣故胡南药标枯柄栋相查柏柳柱柿栏树要咸威歪研砖厘厚砌砍面耐耍牵残殃轻鸦皆背战点临览竖省削尝是盼眨哄显哑冒映星昨畏趴胃贵界虹虾蚁思蚂虽品咽骂哗咱响哈咬咳哪炭峡罚贱贴骨钞钟钢钥钩卸缸拜看矩怎牲选适秒香种秋科重复竿段便俩贷顺修保促侮俭俗俘信皇泉鬼侵追俊盾待律很须叙剑逃食盆胆胜胞胖脉勉狭狮独狡狱狠贸怨急饶蚀饺饼弯将奖哀亭亮度迹庭疮疯疫疤姿亲音帝施闻阀阁差养美姜叛送类迷前首逆总炼炸炮烂剃洁洪洒浇浊洞测洗活派洽染济洋洲浑浓津恒恢恰恼恨举觉宣室宫宪突穿窃客冠语扁袄祖神祝误诱说诵垦退既屋昼费陡眉孩除险院娃姥姨姻娇怒架贺盈勇怠柔垒绑绒结绕骄绘给络骆绝绞统耕耗艳泰珠班素蚕顽盏匪捞栽捕振载赶起盐捎捏埋捉捆捐损都哲逝捡换挽热恐壶挨耻耽恭莲莫荷获晋恶真框桂档桐株桥桃格校核样根索哥速逗栗配翅辱唇夏础破原套逐烈殊顾轿较顿毙致柴桌虑监紧党晒眠晓鸭晃晌晕蚊哨哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅缺氧特牺造乘敌秤租积秧秩称秘透笔笑笋债借值倚倾倒倘俱倡候俯倍倦健臭射躬息徒徐舰舱般航途拿爹爱颂翁脆脂胸胳脏胶脑狸狼逢留皱饿恋桨浆衰高席准座脊症病疾疼疲效离唐资凉站剖竞部旁旅畜阅羞瓶拳粉料益兼烤烘烦烧烛烟递涛浙涝酒涉消浩海涂浴浮流润浪浸涨烫涌悟悄悔悦害宽家宵宴宾窄容宰案请朗诸读扇袜袖袍被祥课谁调冤谅谈谊剥恳展剧屑弱陵陶陷陪娱娘通能难预桑绢绣验继球理捧堵描域掩捷排掉堆推掀授教掏掠培接控探据掘职基著勒黄萌萝菌菜萄菊萍菠营械梦梢梅检梳梯桶救副票戚爽聋袭盛雪辅辆虚雀堂常匙晨睁眯眼悬野啦晚啄距跃略蛇累唱患唯崖崭崇圈铜铲银甜梨犁移笨笼笛符第敏做袋悠偿偶偷您售停偏假得衔盘船斜盒鸽悉欲彩领脚脖脸脱象够猜猪猎猫猛馅馆凑减毫麻痒痕廊康庸鹿盗章竟商族旋望率着盖粘粗粒断剪兽清添淋淹渠渐混渔淘液淡深婆梁渗情惜惭悼惧惕惊惨惯寇寄宿窑密谋谎祸谜逮敢屠弹随蛋隆隐婚婶颈绩绪续骑绳维绵绸绿琴斑替款堪搭塔越趁趋超提堤博揭喜插揪搜煮援裁搁搂搅握揉斯期欺联散惹葬葛董葡敬葱落朝辜葵棒棋植森椅椒棵棍棉棚棕惠惑逼厨厦硬确雁殖裂雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶喇遇喊景践跌跑遗蛙蛛蜓喝喂喘喉幅帽赌赔黑铸铺链销锁锄锅锈锋锐短智毯鹅剩稍程稀税筐等筑策筛筒答筋筝傲傅牌堡集焦傍储奥街惩御循艇舒番释禽腊脾腔鲁猾猴然馋装蛮就痛童阔善羡普粪尊道曾焰港湖渣湿温渴滑湾渡游滋溉愤慌惰愧愉慨割寒富窜窝窗遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂登缎缓编骗缘瑞魂肆摄摸填搏塌鼓摆携搬摇搞塘摊蒜勤鹊蓝墓幕蓬蓄蒙蒸献禁楚想槐榆楼概赖酬感碍碑碎碰碗碌雷零雾雹输督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪路跟遣蛾蜂嗓置罪罩错锡锣锤锦键锯矮辞稠愁筹签简毁舅鼠催傻像躲微愈遥腰腥腹腾腿触解酱痰廉新韵意粮数煎塑慈煤煌满漠源滤滥滔溪溜滚滨粱滩慎誉塞谨福群殿辟障嫌嫁叠缝缠静碧璃墙撇嘉摧截誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗嗽蜻蜡蝇蜘赚锹锻舞稳算箩管僚鼻魄貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭端旗精歉熄熔漆漂漫滴演漏慢寨赛察蜜谱嫩翠熊凳骡缩慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽樱橡飘醋醉震霉瞒题暴瞎影踢踏踩踪蝶蝴嘱墨镇靠稻黎稿稼箱箭篇僵躺僻德艘膝膛熟摩颜毅糊遵潜潮懂额慰劈操燕薯薪薄颠橘整融醒餐嘴蹄器赠默镜赞篮邀衡膨雕磨凝辨辩糖糕燃澡激懒壁避缴戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥臂翼骤鞭覆蹦镰翻鹰警攀蹲颤瓣爆疆壤耀躁嚼嚷籍魔灌蠢霸露囊罐玖玛韧抠扼汞扳抡坎坞抑拟抒芙芜苇芥芯芭杖杉巫杈甫匣轩卤肖吱吠呕呐吟呛吻吭邑囤吮岖牡佑佃伺囱肛肘甸狈鸠彤灸刨庇吝庐闰兑灼沐沛汰沥沦汹沧沪忱诅诈罕屁坠妓姊妒纬玫卦坷坯拓坪坤拄拧拂拙拇拗茉昔苛苫苟苞茁苔枉枢枚枫杭郁矾奈奄殴歧卓昙哎咕呵咙呻咒咆咖帕账贬贮氛秉岳侠侥侣侈卑刽刹肴觅忿瓮肮肪狞庞疟疙疚卒氓炬沽沮泣泞泌沼怔怯宠宛衩祈诡帚屉弧弥陋陌函姆虱叁绅驹绊绎契贰玷玲珊拭拷拱挟垢垛拯荆茸茬荚茵茴荞荠荤荧荔栈柑栅柠枷勃柬砂泵砚鸥轴韭虐昧盹咧昵昭盅勋哆咪哟幽钙钝钠钦钧钮毡氢秕俏俄俐侯徊衍胚胧胎狰饵峦奕咨飒闺闽籽娄烁炫洼柒涎洛恃恍恬恤宦诫诬祠诲屏屎逊陨姚娜蚤骇耘耙秦匿埂捂捍袁捌挫挚捣捅埃耿聂荸莽莱莉莹莺梆栖桦栓桅桩贾酌砸砰砾殉逞哮唠哺剔蚌蚜畔蚣蚪蚓哩圃鸯唁哼唆峭唧峻赂赃钾铆氨秫笆俺赁倔殷耸舀豺豹颁胯胰脐脓逛卿鸵鸳馁凌凄衷郭斋疹紊瓷羔烙浦涡涣涤涧涕涩悍悯窍诺诽袒谆祟恕娩骏琐麸琉琅措捺捶赦埠捻掐掂掖掷掸掺勘聊娶菱菲萎菩萤乾萧萨菇彬梗梧梭曹酝酗厢硅硕奢盔匾颅彪眶晤曼晦冕啡畦趾啃蛆蚯蛉蛀唬啰唾啤啥啸崎逻崔崩婴赊铐铛铝铡铣铭矫秸秽笙笤偎傀躯兜衅徘徙舶舷舵敛翎脯逸凰猖祭烹庶庵痊阎阐眷焊焕鸿涯淑淌淮淆渊淫淳淤淀涮涵惦悴惋寂窒谍谐裆袱祷谒谓谚尉堕隅婉颇绰绷综绽缀巢琳琢琼揍堰揩揽揖彭揣搀搓壹搔葫募蒋蒂韩棱椰焚椎棺榔椭粟棘酣酥硝硫颊雳翘凿棠晰鼎喳遏晾畴跋跛蛔蜒蛤鹃喻啼喧嵌赋赎赐锉锌甥掰氮氯黍筏牍粤逾腌腋腕猩猬惫敦痘痢痪竣翔奠遂焙滞湘渤渺溃溅湃愕惶寓窖窘雇谤犀隘媒媚婿缅缆缔缕骚瑟鹉瑰搪聘斟靴靶蓖蒿蒲蓉楔椿楷榄楞楣酪碘硼碉辐辑频睹睦瞄嗜嗦暇畸跷跺蜈蜗蜕蛹嗅嗡嗤署蜀幌锚锥锨锭锰稚颓筷魁衙腻腮腺鹏肄猿颖煞雏馍馏禀痹廓痴靖誊漓溢溯溶滓溺寞窥窟寝褂裸谬媳嫉缚缤剿赘熬赫蔫摹蔓蔗蔼熙蔚兢榛榕酵碟碴碱碳辕辖雌墅嘁踊蝉嘀幔镀舔熏箍箕箫舆僧孵瘩瘟彰粹漱漩漾慷寡寥谭褐褪隧嫡缨撵撩撮撬擒墩撰鞍蕊蕴樊樟橄敷豌醇磕磅碾憋嘶嘲嘹蝠蝎蝌蝗蝙嘿幢镊镐稽篓膘鲤鲫褒瘪瘤瘫凛澎潭潦澳潘澈澜澄憔懊憎翩褥谴鹤憨履嬉豫缭撼擂擅蕾薛薇擎翰噩橱橙瓢蟥霍霎辙冀踱蹂蟆螃螟噪鹦黔穆篡篷篙篱儒膳鲸瘾瘸糙燎濒憾懈窿缰壕藐檬檐檩檀礁磷瞭瞬瞳瞪曙蹋蟋蟀嚎赡镣魏簇儡徽爵朦臊鳄糜癌懦豁臀藕藤瞻嚣鳍癞瀑襟璧戳攒孽蘑藻鳖蹭蹬簸簿蟹靡癣羹鬓攘蠕巍鳞糯譬霹躏髓蘸镶瓤矗";
	var hasht = {};
	for(var i=0; i<token.length; i++){
		hasht[token.charAt(i)] = i;
	}
	xcode.btod = function (str) {
		var n = 0;
		for(var i=0; i<str.length; i++){
			n += t2d(str.charAt(i)) << (12*(str.length-i-1));
		}
		return n;
	}
	xcode.dtob = function (n,pad) {
		pad = pad || 1;
		var str = "";
		var i;
		while(n){
			i = n >> 12;
			str = d2t(n - (i<<12)) + str;
			n = i;
		}
		if(str.length<pad) str = d2t(0).repeat(pad-str.length)+str;
		return str;
	}
	var d2t = function(n){
		return token.charAt(n);
	}
	var t2d = function(t){
		return hasht[t];
	}
})();

xcode.enShort = function (n,t){
	if(t>=32){
		if(t>=16384){
			return xcode.dtob((16<<5) + ((t >> 17)&31))+
			xcode.dtob((n<<5) + (t>>12 & 31))+
			xcode.dtob(t & 4095);
			// 16 tt|n tt| tt tt 2^22
		}
		return xcode.dtob((((t>>10)&15)<<5) + ((t >> 5)&31))+
		xcode.dtob((n<<5) + (t & 31));
		// t tt|n tt 2^14
	}
	return xcode.dtob((n<<5) + t);
	// n tt 2^5
}
xcode.deShort = function (arr, pos){
	var bit = xcode.btod(arr[pos.p]);
	var n = bit>>5;
	if(n>16)return {n: n, t: bit&31}
	var bit2 = xcode.btod(arr[++pos.p]);
	var n2 = bit2>>5;
	if(n == 16){
		var bit3 = xcode.btod(arr[++pos.p]);
		return {n: n2, t: bit3 + ((bit2&31)<<12) + ((bit&31)<<17)};
	}
	return {n: n2, t: (bit2&31) + ((bit&31)<<5) + (n<<10)}
}
xcode.getT = function(t,gap){
	if(gap){
		return Math.round(t/gap*12);// 12 is for detail gcd 2 3 4
	}
	return Math.round(t);
}
xcode.setT = function(t,gap){
	if(gap){
		return Math.round(t*gap/12);// 12 is for detail gcd 2 3 4
	}
	return Math.round(t);
}
xcode.diff = function (ctxt,g){
	var nctxt = [];
	for(var i=0; i<ctxt.length; i++){
		nctxt[i] = {t: i?(xcode.getT(ctxt[i].t,g) - xcode.getT(ctxt[i-1].t,g)):xcode.getT(ctxt[i].t,g),
		n: ctxt[i].n,
		v: ctxt[i].v,
		d: ctxt[i].d,
		c: ctxt[i].c};
	}
	return nctxt;
}
xcode.integ = function (ctxt, grid){
	var nctxt = [];
	var T = 0;
	for(var i=0; i<ctxt.length; i++){
		T += ctxt[i].t;
		nctxt[i] = {t: xcode.setT(T,grid),
		n: ctxt[i].n,
		v: ctxt[i].v || PLAYER.autoVolume(ctxt[i].n),
		d: ctxt[i].d,
		c: ctxt[i].c};
	}
	return nctxt;
}
xcode.en = function (ctxt,grid){
	var txt = xcode.diff(ctxt,grid);
	var S = grid ? Math.round(60/grid*10000)/10+"|" : "";
	for(var i=0; i<ctxt.length; i++){
		S += xcode.enShort(txt[i].n,txt[i].t);
	}
	return S;
}
xcode.de = function (txt){
	var pos = {p:0};
	var bpm = txt.split("|");
	var ctxt = [];
	var g = 0;
	grid.enable = false;
	if(bpm.length>1){grid.enable = true;txt = bpm[1];g = grid.gap = 60000/bpm[0];}
	while (pos.p < txt.length){
		ctxt.push(xcode.deShort(txt, pos));
		pos.p++;
	}
	return xcode.integ(ctxt,g);
}